conf/src/Catalogs/Патчи/Патчи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Патчи</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ошибка</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Ошибки</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПроекта</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторИсправления</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СостоянияПроверкиПатча</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияПатча</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнил</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПатча</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/InformationRegisters/ВерсииПатчей/ВерсииПатчей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииПатчей</name>
  <resources>
    <name>НачальнаяСборка</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </resources>
  <resources>
    <name>КонечнаяСборка</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПатча</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыПатчей</types>
    </type>
  </resources>
  <resources>
    <name>КонечнаяСборкаПоХранилищу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИзменяемыеМетаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиПересчетаПрименимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанДляКонфигурации</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтзыва</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПатча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Патч</name>
    <type>
      <types>CatalogRef.Патчи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/СтатусыПатчей/СтатусыПатчей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПатчей</name>
  <enumValues>
    <name>ОжиданиеИсправления</name>
  </enumValues>
  <enumValues>
    <name>СозданНеПроверен</name>
  </enumValues>
  <enumValues>
    <name>СозданПроверен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПубликации</name>
  </enumValues>
  <enumValues>
    <name>Публикуется</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПубликации</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтзыва</name>
  </enumValues>
  <enumValues>
    <name>ОпубликованОбновлениеПрименимости</name>
  </enumValues>
  <enumValues>
    <name>СозданиеПатча</name>
  </enumValues>
  <enumValues>
    <name>ПатчНеТребуется</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВручную</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/Патчи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ТекущиеДела

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Справочники.Ошибки) Тогда
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	// Патчи, которые требуется проверить разработчику, исправившему ошибку.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Состояние", Перечисления.СтатусыПатчей.СозданНеПроверен);
	Запрос.УстановитьПараметр("Исправил", ТекущийПользователь);
	Запрос.УстановитьПараметр("ПодписанДляКонфигурации", Справочники.Проекты.ПустаяСсылка());
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВерсииПатчей.Патч КАК Патч,
		|	Патчи.Владелец КАК Проект,
		|	ВерсииПатчей.УникальныйИдентификатор КАК УникальныйИдентификатор
		|ИЗ
		|	РегистрСведений.ВерсииПатчей КАК ВерсииПатчей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патчи КАК Патчи
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Ошибки КАК Ошибки
		|			ПО Патчи.Ошибка = Ошибки.Ссылка
		|		ПО ВерсииПатчей.Патч = Патчи.Ссылка
		|ГДЕ
		|	ВерсииПатчей.Состояние = &Состояние
		|	И (Ошибки.Исправил = &Исправил
		|			ИЛИ Патчи.АвторИсправления = &Исправил)
		|	И НЕ Патчи.ПометкаУдаления
		|	И ВерсииПатчей.ПодписанДляКонфигурации = &ПодписанДляКонфигурации";
	Результат = Запрос.Выполнить().Выгрузить();
	ДополнительныйКонтрольПоПроектам = Новый Соответствие;
	ПатчиПоАвтору = Новый Массив;
	Для Каждого Строка Из Результат Цикл
		Если ДополнительныйКонтрольПоПроектам[Строка.Проект] = Неопределено Тогда
			СвойстваПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.Проект, "ПроверкаПатчаПередПубликацией,АудитПатчаПередПубликацией");
			НуженКонтроль = СвойстваПроекта.ПроверкаПатчаПередПубликацией И СвойстваПроекта.АудитПатчаПередПубликацией;
			ДополнительныйКонтрольПоПроектам.Вставить(Строка.Проект, НуженКонтроль);
		КонецЕсли;
		
		Если ДополнительныйКонтрольПоПроектам[Строка.Проект] Тогда
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Роль", "Разработчик");
			Запрос.УстановитьПараметр("ИдентификаторПатча", Строка.УникальныйИдентификатор);
			Запрос.Текст =
				"ВЫБРАТЬ
				|	ПатчиСостоянияПроверкиПатча.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Патчи.СостоянияПроверкиПатча КАК ПатчиСостоянияПроверкиПатча
				|ГДЕ
				|	ПатчиСостоянияПроверкиПатча.Роль = &Роль
				|	И ПатчиСостоянияПроверкиПатча.ИдентификаторПатча = &ИдентификаторПатча";
			Если Запрос.Выполнить().Выгрузить().Количество() = 0
				И ПатчиПоАвтору.Найти(Строка.Патч) = Неопределено Тогда
				ПатчиПоАвтору.Добавить(Строка.Патч);
			КонецЕсли;
		ИначеЕсли ПатчиПоАвтору.Найти(Строка.Патч) = Неопределено Тогда
			ПатчиПоАвтору.Добавить(Строка.Патч);
		КонецЕсли;
		
	КонецЦикла;
	
	// Патчи, которые требуется проверить проверяющему или аудитору.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ПодписанДляКонфигурации", Справочники.Проекты.ПустаяСсылка());
	Запрос.УстановитьПараметр("Состояние", Перечисления.СтатусыПатчей.СозданНеПроверен);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Патчи.Ссылка КАК Ссылка,
		|	ВерсииПатчей.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	Патчи.Проверяющий КАК Проверяющий,
		|	Патчи.Аудитор КАК Аудитор
		|ИЗ
		|	Справочник.Патчи КАК Патчи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииПатчей КАК ВерсииПатчей
		|		ПО (ВерсииПатчей.Патч = Патчи.Ссылка)
		|ГДЕ
		|	(Патчи.Проверяющий = &ТекущийПользователь
		|			ИЛИ Патчи.Аудитор = &ТекущийПользователь)
		|	И ВерсииПатчей.Состояние = &Состояние
		|	И НЕ Патчи.ПометкаУдаления
		|	И ВерсииПатчей.ПодписанДляКонфигурации = &ПодписанДляКонфигурации";
	ОжидаютПроверки = Запрос.Выполнить().Выгрузить();
	ТребуютПроверки = Новый Массив;
	Для Каждого ОжидаетПроверки Из ОжидаютПроверки Цикл
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИдентификаторПатча", ОжидаетПроверки.УникальныйИдентификатор);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПатчиСостоянияПроверкиПатча.Роль КАК Роль
			|ИЗ
			|	Справочник.Патчи.СостоянияПроверкиПатча КАК ПатчиСостоянияПроверкиПатча
			|ГДЕ
			|	ПатчиСостоянияПроверкиПатча.ИдентификаторПатча = &ИдентификаторПатча";
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");
		Если Результат.Найти("Разработчик") <> Неопределено Тогда
			Если (ОжидаетПроверки.Проверяющий = ТекущийПользователь
				   И Результат.Найти("Проверяющий") = Неопределено)
				Или (ОжидаетПроверки.Аудитор = ТекущийПользователь
				   И Результат.Найти("Аудитор") = Неопределено) Тогда
				ТребуютПроверки.Добавить(ОжидаетПроверки.Ссылка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Патчи, которые необходимо опубликовать.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущиийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("Состояние", Перечисления.СтатусыПатчей.СозданПроверен);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Патчи.Ссылка КАК Ссылка,
		|	Патчи.Владелец КАК Проект
		|ИЗ
		|	РегистрСведений.ВерсииПатчей КАК ВерсииПатчей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Патчи КАК Патчи
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Ошибки КАК Ошибки
		|			ПО Патчи.Ошибка = Ошибки.Ссылка
		|		ПО ВерсииПатчей.Патч = Патчи.Ссылка
		|ГДЕ
		|	(Патчи.АвторИсправления = &ТекущиийПользователь
		|			ИЛИ Ошибки.Исправил = &ТекущиийПользователь
		|			ИЛИ Патчи.Проверяющий = &ТекущиийПользователь
		|			ИЛИ Патчи.Аудитор = &ТекущиийПользователь)
		|	И ВерсииПатчей.Состояние = &Состояние";
	Результат = Запрос.Выполнить().Выгрузить();
	ПатчиДляПубликации = Новый Массив;
	ВозможностьПубликацииПоПроекту = Новый Соответствие;
	Для Каждого Строка Из Результат Цикл
		Если ВозможностьПубликацииПоПроекту[Строка.Проект] = Неопределено Тогда
			ПубликацияДоступна = УправлениеДоступомСППР.РольДоступнаПоПроекту("ПубликацияПатчей", Строка.Проект);
			ВозможностьПубликацииПоПроекту[Строка.Проект] = ПубликацияДоступна;
		КонецЕсли;
		
		Если ВозможностьПубликацииПоПроекту[Строка.Проект]
			И ПатчиДляПубликации.Найти(Строка.Ссылка) = Неопределено Тогда
			ПатчиДляПубликации.Добавить(Строка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ПатчиПоАвтору, ТребуютПроверки);
	
	ИдентификаторРаздела = НСтр("ru = 'Патчи'");
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ПатчиПоАвтору);
	
	ОтборОпубликовать = Новый Структура;
	ОтборОпубликовать.Вставить("Ссылка", ПатчиДляПубликации);
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор  = "ПроверитьПатчи";
	Дело.ЕстьДела       = ПатчиПоАвтору.Количество() > 0;
	Дело.Представление  = НСтр("ru = 'Проверить патчи'");
	Дело.Количество     = ПатчиПоАвтору.Количество();
	Дело.ВыводитьВОповещениях = Истина;
	Дело.Важное         = Истина;
	Дело.ПараметрыФормы = Новый Структура("Отбор", Отбор);
	Дело.Форма          = "Справочник.Патчи.ФормаСписка";
	Дело.Владелец       = ИдентификаторРаздела;
	
	Дело = ТекущиеДела.Добавить();
	Дело.Идентификатор  = "ОпубликоватьПатчи";
	Дело.ЕстьДела       = ПатчиДляПубликации.Количество() > 0;
	Дело.Представление  = НСтр("ru = 'Опубликовать патчи'");
	Дело.Количество     = ПатчиДляПубликации.Количество();
	Дело.ВыводитьВОповещениях = Истина;
	Дело.Важное         = Истина;
	Дело.ПараметрыФормы = Новый Структура("Отбор", ОтборОпубликовать);
	Дело.Форма          = "Справочник.Патчи.ФормаСписка";
	Дело.Владелец       = ИдентификаторРаздела;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ТекущиеДела

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СтатусПатча(Патч) Экспорт
	
	Публикуется = Новый Массив;
	Публикуется.Добавить(Перечисления.СтатусыПатчей.Публикуется);
	Публикуется.Добавить(Перечисления.СтатусыПатчей.ОжидаетПубликации);
	
	Создание = Новый Массив;
	Создание.Добавить(Перечисления.СтатусыПатчей.ОжиданиеИсправления);
	Создание.Добавить(Перечисления.СтатусыПатчей.СозданиеПатча);
	Создание.Добавить(Перечисления.СтатусыПатчей.СозданиеВручную);
	
	Ошибка = Новый Массив;
	Ошибка.Добавить(Перечисления.СтатусыПатчей.Ошибка);
	Ошибка.Добавить(Перечисления.СтатусыПатчей.ОшибкаОтзыва);
	Ошибка.Добавить(Перечисления.СтатусыПатчей.ОшибкаПубликации);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Опубликован", Перечисления.СтатусыПатчей.Опубликован);
	Запрос.УстановитьПараметр("ТребуетПроверки", Перечисления.СтатусыПатчей.СозданНеПроверен);
	Запрос.УстановитьПараметр("Проверен", Перечисления.СтатусыПатчей.СозданПроверен);
	Запрос.УстановитьПараметр("НеТребуется", Перечисления.СтатусыПатчей.ПатчНеТребуется);
	Запрос.УстановитьПараметр("Публикуется", Публикуется);
	Запрос.УстановитьПараметр("Создание", Создание);
	Запрос.УстановитьПараметр("Ошибка", Ошибка);
	Запрос.УстановитьПараметр("Отозван", Перечисления.СтатусыПатчей.Отозван);
	Запрос.УстановитьПараметр("ПатчСсылка", Патч);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВерсииПатчей.Патч КАК Патч,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние = &Опубликован
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Опубликовано,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние В (&Публикуется)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Публикуется,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние = &ТребуетПроверки
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ТребуютПроверки,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние = &Проверен
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Проверен,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние В (&Создание)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Создается,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние В (&Ошибка)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Ошибка,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние = &НеТребуется
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеТребуется,
		|	СУММА(ВЫБОР
		|			КОГДА ВерсииПатчей.Состояние = &Отозван
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Отозван,
		|	ВерсииПатчей.ПодписанДляКонфигурации КАК ПодписанДляКонфигурации
		|ИЗ
		|	РегистрСведений.ВерсииПатчей КАК ВерсииПатчей
		|ГДЕ
		|	ВерсииПатчей.Патч = &ПатчСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВерсииПатчей.Патч,
		|	ВерсииПатчей.ПодписанДляКонфигурации";
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбщееСостояние = "";
	Для Каждого ПатчИСостояние Из Результат Цикл
		Если ЗначениеЗаполнено(ПатчИСостояние.ПодписанДляКонфигурации) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщееСостояние = "";
		ВсеОпубликованы = Истина;
		Если ПатчИСостояние.Опубликовано <> 0 Тогда
			Состояние = НСтр("ru = 'Опубликовано: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Опубликовано);
		КонецЕсли;
		
		Если ПатчИСостояние.Публикуется <> 0 Тогда
			Состояние = НСтр("ru = 'Публикуется: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Публикуется);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.ТребуютПроверки <> 0 Тогда
			Состояние = НСтр("ru = 'Требуется проверка: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.ТребуютПроверки);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.Проверен <> 0 Тогда
			Состояние = НСтр("ru = 'Проверено: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Проверен);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.Создается <> 0 Тогда
			Состояние = НСтр("ru = 'Создание: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Создается);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.Ошибка <> 0 Тогда
			Состояние = НСтр("ru = 'Ошибка: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Ошибка);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.НеТребуется <> 0 Тогда
			Состояние = НСтр("ru = 'Не требуется: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.НеТребуется);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ПатчИСостояние.Отозван <> 0 Тогда
			Состояние = НСтр("ru = 'Отозвано: %1'");
			ДобавитьСостояние(ОбщееСостояние, Состояние, ПатчИСостояние.Отозван);
			ВсеОпубликованы = Ложь;
		КонецЕсли;
		
		Если ВсеОпубликованы Тогда
			ОбщееСостояние = НСтр("ru = 'Опубликовано'");
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбщееСостояние;
КонецФункции

Процедура ДобавитьСостояние(ОбщееСостояние, ДобавляемоеСостояние, Количество)
	ДобавляемоеСостояние = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ДобавляемоеСостояние, Количество);
	Если ЗначениеЗаполнено(ОбщееСостояние) Тогда
		ОбщееСостояние = ОбщееСостояние + ", " + ДобавляемоеСостояние;
	Иначе
		ОбщееСостояние = ДобавляемоеСостояние;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
